In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.sample(4)

           date  product_id  city_id  orders
176  2018-12-16        1475       16       8
1    2018-08-15        3646       14     157
475  2019-07-25        2898       18      98
653  2019-02-27        6937       13      14

In [5]:
time.sample(4)

                    date                                                msg
598  2012-09-26 01:01:00  П. 20 Л. ПАЗНАКОМЕЦА С ДЕВУШКОЙ ДЛЯ С/О С ДНЕП...
796  2015-12-10 00:57:00       позн с сем парой для встреч 0501911095 днепр
872  2014-02-06 00:26:00         если девушки готовые на откровения звоните
599  2013-02-26 23:50:00  Янка привет тебе по Жовтневке думаю ты скоро б...

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [9]:
date['date'] = pd.to_datetime(date['date'])

In [11]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [12]:
date.sample(2)

          date  product_id  city_id  orders
899 2019-07-12        3247        0       3
937 2019-08-19        1047       30       5

In [13]:
date['date_year'] = date['date'].dt.year

date.sample(5)

          date  product_id  city_id  orders  date_year
334 2019-10-27        1130       14      48       2019
607 2019-05-27        3685        0       1       2019
283 2018-10-17         390        9       5       2018
257 2019-05-03        1364       30       2       2019
435 2018-10-20        4847       26       9       2018

In [15]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [16]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [17]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_dow
0,2019-12-10,5628,25,3,2019,12,December,1
1,2018-08-15,3646,14,157,2018,8,August,2
2,2018-10-23,1859,25,1,2018,10,October,1
3,2019-08-17,7292,25,1,2019,8,August,5
4,2019-01-06,4344,25,3,2019,1,January,6

In [18]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_year  date_month_no date_month_name  date_dow date_dow_name
0 2019-12-10       2019             12        December         1       Tuesday
1 2018-08-15       2018              8          August         2     Wednesday
2 2018-10-23       2018             10         October         1       Tuesday
3 2019-08-17       2019              8          August         5      Saturday
4 2019-01-06       2019              1         January         6        Sunday

In [19]:

# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,1,Tuesday,0
1,2018-08-15,2018,8,August,2,Wednesday,0
2,2018-10-23,2018,10,October,1,Tuesday,0
3,2019-08-17,2019,8,August,5,Saturday,1
4,2019-01-06,2019,1,January,6,Sunday,1

In [21]:

import datetime

today = datetime.datetime.today()

today

datetime.datetime(2024, 12, 9, 22, 15, 33, 809105)

In [22]:
today - date['date']

0     1826 days 22:15:33.809105
1     2308 days 22:15:33.809105
2     2239 days 22:15:33.809105
3     1941 days 22:15:33.809105
4     2164 days 22:15:33.809105
                 ...
995   2254 days 22:15:33.809105
996   2195 days 22:15:33.809105
997   2043 days 22:15:33.809105
998   2108 days 22:15:33.809105
999   1882 days 22:15:33.809105
Name: date, Length: 1000, dtype: timedelta64[ns]

In [23]:
(today - date['date']).dt.days

0      1826
1      2308
2      2239
3      1941
4      2164
       ...
995    2254
996    2195
997    2043
998    2108
999    1882
Name: date, Length: 1000, dtype: int64

In [24]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

ValueError: Unit M is not supported. Only unambiguous timedelta values durations are supported. Allowed units are 'W', 'D', 'h', 'm', 's', 'ms', 'us', 'ns'

In [25]:

time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [26]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [27]:

time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [28]:

time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [29]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [30]:

today - time['date']

0     4012 days 21:25:33.809105
1     3876 days 22:35:33.809105
2     4362 days 21:54:33.809105
3     3664 days 21:44:33.809105
4     4061 days 23:04:33.809105
                 ...
995   4651 days 21:25:33.809105
996   3972 days 23:01:33.809105
997   4437 days 22:38:33.809105
998   4553 days 22:41:33.809105
999   3825 days 22:50:33.809105
Name: date, Length: 1000, dtype: timedelta64[ns]

In [31]:

# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.467139e+08
1      3.349677e+08
2      3.769557e+08
3      3.166479e+08
4      3.509535e+08
           ...
995    4.019235e+08
996    3.432637e+08
997    3.834383e+08
998    3.934609e+08
999    3.305622e+08
Name: date, Length: 1000, dtype: float64

In [32]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      5.778566e+06
1      5.582796e+06
2      6.282595e+06
3      5.277465e+06
4      5.849225e+06
           ...
995    6.698726e+06
996    5.721062e+06
997    6.390639e+06
998    6.557682e+06
999    5.509371e+06
Name: date, Length: 1000, dtype: float64

In [33]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       96309.426058
1       93046.592725
2      104709.909391
3       87957.742725
4       97487.076058
           ...
995    111645.426058
996     95351.026058
997    106510.642725
998    109294.692725
999     91822.842725
Name: date, Length: 1000, dtype: float64